Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectPicker.PickObject Method
 Prompts the user to pick object from the model with the given prompt. Object is either analysis object or model object.
 Namespace: Tekla.Structures.Analysis.UI
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObject PickObject(
	string analysisModelName,
	AnalysisObjectPicker.PickObjectType type,
	string prompt
)
Public Function PickObject (
	analysisModelName As String,
	type As AnalysisObjectPicker.PickObjectType,
	prompt As String
) As AnalysisObject
Parameters
analysisModelName
Type: System.String
The analysis model name.
type
Type: Tekla.Structures.Analysis.UI.AnalysisObjectPicker.PickObjectType
The type of object to pick.
prompt
Type: System.String
The string to display as user guidance.
Return Value
Type: AnalysisObject
The analysis object instance.
See Also
Reference
AnalysisObjectPicker Class
Tekla.Structures.Analysis.UI Namespace